Tekla.Structures.ModelInternal.ExternalDraw
External draw

Tekla.Structures.ModelInternal.ExternalDraw.MODEL2_SCHEMA
Model2 schema (the only schema which can be used now).

Tekla.Structures.ModelInternal.ExternalDraw.DrawObject(System.Guid,System.String,Tekla.Structures.Model.UI.Color,System.Int32)
Draw object.
modelObjectGuid: The model object GUID.
schema:
The schema. MODEL2_SCHEMA is the only option currently and Model2 needs be loaded before drawing.
DrawObject need NOT to be done within Operation.Model2.
color: The color for the object.
viewId: The view ID (0 if current view).
Returns: The external draw identifier of the object.

Tekla.Structures.ModelInternal.ExternalDraw.RemoveObject(System.Guid)
Remove object from all views.
guid: The external draw identifier of the object.
Returns: True if successful.

Tekla.Structures.ModelInternal.ExternalDraw.RemoveSchemaObjects(System.String)
Removes all schema objects from all views.
schema: The schema.

Tekla.Structures.ModelInternal.ExternalDraw.GetGuidByModelObjectGuid(System.Guid,System.String)
Get the external draw identifier of the object.
modelObjectGuid: The model object GUID.
schema: The schema. MODEL2_SCHEMA is the only option currently.
Returns: The external draw identifier of the object, empty guid if failed.

Tekla.Structures.ModelInternal.ExternalDraw.UiSelect(System.Collections.Generic.IList{System.Guid})
Selects a list of objects from the user interface.
guids: The external draw identifiers.

Tekla.Structures.ModelInternal.ExternalDraw.GetReturnedGuid(Tekla.Structures.ModelInternal.dotExternalDrawOperation_t)
Get the guid from operation struct.
operation: The operation struct.
Returns: The guid from operation struct.